bradlc.vscode-tailwindcss
chakrounanas.turbo-console-log
christian-kohler.npm-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dotenv.dotenv-vscode
dsznajder.es7-react-js-snippets
eliverlara.andromeda
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
gabrielbatista.davinci
github.copilot-chat
liviuschera.noctis
llvm-vs-code-extensions.vscode-clangd
luis-reyes.synth-wave-remix
mgmcdermott.vscode-language-babel
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
naumovs.color-highlight
pkief.material-icon-theme
ritwickdey.liveserver
simonsiefke.svg-preview
steoates.autoimport
streetsidesoftware.code-spell-checker
tinuthampi.pulpy-orange
vscodevim.vim
wakatime.vscode-wakatime
wix.vscode-import-cost
yzhang.markdown-all-in-one
